tap "homebrew/bundle"
tap "quarkusio/tap"
brew "openssl@3"
brew "python@3.12"
brew "clang-format"
brew "git"
brew "openjdk"
brew "google-java-format"
brew "maven"
brew "ruff"
brew "rustup"
brew "quarkusio/tap/quarkus"
cask "firefox"
cask "intellij-idea"
cask "protonvpn"
cask "visual-studio-code"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "vscodevim.vim"
