tap "homebrew/bundle"
brew "bazel"
brew "buildifier"
brew "buildozer"
brew "clang-format"
brew "duckdb"
brew "openjdk"
brew "flyway"
brew "git"
brew "openssl@3"
brew "git-crypt"
brew "go"
brew "google-java-format"
brew "maven"
brew "protobuf"
brew "python@3.14"
brew "ruff"
brew "uv"
cask "firefox"
cask "intellij-idea"
cask "protonvpn"
cask "visual-studio-code"
vscode "charliermarsh.ruff"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "vscodevim.vim"
go "github.com/protocolbuffers/txtpbfmt/cmd/txtpbfmt"
