tap "quarkusio/tap"
brew "clang-format"
brew "duckdb"
brew "git"
brew "openssl@3"
brew "git-crypt"
brew "go"
brew "openjdk"
brew "google-java-format"
brew "make"
brew "maven"
brew "podman"
brew "python@3.14"
brew "ruff"
brew "uv"
brew "quarkusio/tap/quarkus"
cask "firefox"
cask "font-inconsolata"
cask "intellij-idea"
cask "protonvpn"
cask "visual-studio-code"
vscode "charliermarsh.ruff"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "vscodevim.vim"
go "github.com/protocolbuffers/txtpbfmt/cmd/txtpbfmt"
